set sdc_version 2.0

set_units -capacitance 1fF
set_units -time 1000ps

# Set the current design
current_design pic_16f84_core

create_clock -name "clk" -period 1.0 -waveform {0.0 0.5} [list \
  [get_ports int7_i]  \
  [get_ports int6_i]  \
  [get_ports int5_i]  \
  [get_ports int4_i]  \
  [get_ports int0_i]  \
  [get_ports wdt_clk_i]  \
  [get_ports clk_i] ]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports clk_i]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports mclr_n_i]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports pon_rst_n_i]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports wdt_clk_i]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports wdt_ena_i]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports t0cki_i]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports int7_i]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports int6_i]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports int5_i]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports int4_i]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports int0_i]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {portb_i[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {portb_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {portb_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {portb_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {portb_i[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {portb_i[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {portb_i[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {portb_i[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {porta_i[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {porta_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {porta_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {porta_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {porta_i[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports wr_eep_ack_i]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports rd_eep_ack_i]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {eep_dat_i[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {eep_dat_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {eep_dat_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {eep_dat_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {eep_dat_i[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {eep_dat_i[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {eep_dat_i[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {eep_dat_i[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports existeeprom_i]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ram_dat_i[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ram_dat_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ram_dat_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ram_dat_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ram_dat_i[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ram_dat_i[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ram_dat_i[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ram_dat_i[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {prog_dat_i[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {prog_dat_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {prog_dat_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {prog_dat_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {prog_dat_i[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {prog_dat_i[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {prog_dat_i[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {prog_dat_i[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {prog_dat_i[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {prog_dat_i[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {prog_dat_i[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {prog_dat_i[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {prog_dat_i[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {prog_dat_i[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports clk_o]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports startclk_o]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports powerdown_o]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports wdt_full_o]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports rbpu_o]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {portb_dir_o[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {portb_dir_o[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {portb_dir_o[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {portb_dir_o[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {portb_dir_o[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {portb_dir_o[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {portb_dir_o[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {portb_dir_o[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {portb_o[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {portb_o[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {portb_o[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {portb_o[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {portb_o[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {portb_o[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {portb_o[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {portb_o[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {porta_dir_o[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {porta_dir_o[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {porta_dir_o[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {porta_dir_o[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {porta_dir_o[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {porta_o[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {porta_o[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {porta_o[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {porta_o[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {porta_o[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports wr_eep_req_o]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports rd_eep_req_o]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {eep_adr_o[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {eep_adr_o[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {eep_adr_o[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {eep_adr_o[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {eep_adr_o[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {eep_adr_o[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {eep_adr_o[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {eep_adr_o[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {eep_dat_o[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {eep_dat_o[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {eep_dat_o[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {eep_dat_o[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {eep_dat_o[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {eep_dat_o[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {eep_dat_o[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {eep_dat_o[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports writeram_o]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports readram_o]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ram_adr_o[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ram_adr_o[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ram_adr_o[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ram_adr_o[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ram_adr_o[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ram_adr_o[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ram_adr_o[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ram_adr_o[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ram_adr_o[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ram_dat_o[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ram_dat_o[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ram_dat_o[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ram_dat_o[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ram_dat_o[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ram_dat_o[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ram_dat_o[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ram_dat_o[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {prog_adr_o[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {prog_adr_o[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {prog_adr_o[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {prog_adr_o[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {prog_adr_o[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {prog_adr_o[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {prog_adr_o[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {prog_adr_o[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {prog_adr_o[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {prog_adr_o[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {prog_adr_o[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {prog_adr_o[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {prog_adr_o[12]}]
set_wire_load_mode "enclosed"
